app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)
---
  def index
    @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 1
---
  def show
    @tweet = Tweet.find(params[:id])
    comments = @tweet.comments.includes(:user)

INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('さくら', 'http://www.yamane-m.co.jp/woody-reform/blog/wp-content/uploads/2012/07/original.jpg', '海に行きたい！', 1, '2015-05-06 06:41:31', '2015-05-06 06:41:31')
---
  def create
    Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 4 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 4
---
  def destroy
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.destroy

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 6 LIMIT 1
UPDATE `tweets` SET `image` = 'sssdsfcwadc', `text` = 'sssdvdscaae', `updated_at` = '2015-09-19 04:08:27' WHERE `tweets`.`id` = 2
---
  def update
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.update(tweet_params)